---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DuctFailures.NoDuctFittingsInProject
source: html/17775677-379c-2cb5-2b3f-86e56affea0d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DuctFailures.NoDuctFittingsInProject Property

There are no duct fittings defined in project. The default duct type for fittings will be set to none.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoDuctFittingsInProject { get; }
```